''' 
學習變數與資料型態
    資料是程式中的基本單位
        資料型態:
            1.數字
                (1)整數
                (2)長整數
                (3)浮點數 #即小數
            
            2.字串
                ->各種文字
            
            3.布林值
                (1)True
                (2)False
            4.可變列表 #List
                ->有順序但可變動的資料集合
            
            5.固定列表 #Tuple
                ->有順序且不可變動的資料集合
            
            6.集合
                ->無順序的資料
            
            7.字典
                ->有對應的集合(鍵值對 Key-Value Pair)

            8.變數
                ->存放資料
          
'''